# InstanceProfileNotMatchWithHostError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPSupportFailures..::..InstanceProfileNotMatchWithHostError Property
BuiltInFailures..::..MEPSupportFailures Class See Also
---
The [Symbol]'s profile does not match the host. Instances of [Symbol] will be deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InstanceProfileNotMatchWithHostError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InstanceProfileNotMatchWithHostError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InstanceProfileNotMatchWithHostError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPSupportFailures Class
Autodesk.Revit.DB Namespace